define({
	"title": "เคียว",
	"recording": {
		"start": "เริ่มการบันทึก",
		"stop": "หยุดการบันทึก"
	},
	"picture": "จับภาพ",
	"network": "เครือข่าย",
	"gpsPermissionDenied": "ไม่มีตำแหน่งจีพีเอสที่ได้รับเป็นเพราะจีพีเอสมีการยกเลิกหรือการอนุมัติที่จำเป็นต้องได้รับอนุญาต",
	"inactive": "เฉื่อยชา",
	"active": "กระตือรือร้น",
	"errorTitle": "เกิดข้อผิดพลาด",
	"inviteError": "รับเชิญออกนอนหลับ โปรดปรึกษา support@frjsh.com",
	"defaultError": "มีบางสิ่งบางอย่างที่ผิดพลาด! โปรดลองอีกครั้งหรือเปิดไป support@frjsh.com",
	"photoTitle": "ภาพอัพโหลด",
	"photoMessage": "ภาพของคุณได้รับการอัปโหลดที่ประสบความสำเร็จ",
	"noGPSTitle": "จีพีเอสไม่มี",
	"noGPSMessage": "โดยไม่ต้องมีตำแหน่งจีพีเอสที่เหมาะสมไม่สามารถถ่ายภาพ!",
	"noPhotoMessage": "ภาพไม่สามารถอัปโหลด"
});