[
  {
    "probability": "HIGH",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CH21",
    "name": "SecurityDuringProcessingContent"
  },
  {
    "probability": "MEDIUM",
    "found": false,
    "snippets": [],
    "extra": {
      "featureRatio": 0
    },
    "hierarchy": "CH22",
    "name": "SecurityDuringStorageContent"
  },
  {
    "probability": "HIGH",
    "found": false,
    "snippets": [],
    "extra": {
      "HttpURLConnections": 0,
      "HttpsURLConnections": 0
    },
    "hierarchy": "CH23",
    "name": "SecurityDuringTransferContent"
  },
  {
    "probability": "MEDIUM",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CH310",
    "name": "SharingWithPublicContent"
  },
  {
    "probability": "MEDIUM",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CH312",
    "name": "SharingWithUserAuthorizedContent"
  },
  {
    "probability": "HIGH",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CH33",
    "name": "SharingWithAdvertiserContent"
  },
  {
    "probability": "LOW",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CH34",
    "name": "SharingWithAggregatorContent"
  },
  {
    "probability": "HIGH",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CH35",
    "name": "SharingWithAnalystContent"
  },
  {
    "probability": "LOW",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CH36",
    "name": "SharingWithDeliveryContent"
  },
  {
    "probability": "LOW",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CH37",
    "name": "SharingWithGovernmentContent"
  },
  {
    "probability": "MEDIUM",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CH38",
    "name": "SharingWithOtherUsersContent"
  },
  {
    "probability": "LOW",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CH42",
    "name": "CloudStorageContent"
  },
  {
    "probability": "HIGH",
    "found": false,
    "snippets": [
      {
        "lineNumber": 96,
        "file": "/Volumes/Macintosh/Users/thomasbruggemann/Sites/AIPRAT/analyze/data/com.drugguide.quiz/android/support/v4/util/AtomicFile.java",
        "line": "FileOutputStream var1 \u003d new FileOutputStream(this.mBaseName);",
        "extra": {}
      },
      {
        "lineNumber": 103,
        "file": "/Volumes/Macintosh/Users/thomasbruggemann/Sites/AIPRAT/analyze/data/com.drugguide.quiz/android/support/v4/util/AtomicFile.java",
        "line": "FileOutputStream var3 \u003d new FileOutputStream(this.mBaseName);",
        "extra": {}
      }
    ],
    "extra": {},
    "hierarchy": "CH43",
    "name": "LocalStorageContent"
  },
  {
    "probability": "HIGH",
    "found": false,
    "snippets": [
      {
        "lineNumber": 96,
        "file": "/Volumes/Macintosh/Users/thomasbruggemann/Sites/AIPRAT/analyze/data/com.drugguide.quiz/android/support/v4/util/AtomicFile.java",
        "line": "FileOutputStream var1 \u003d new FileOutputStream(this.mBaseName);",
        "extra": {}
      },
      {
        "lineNumber": 103,
        "file": "/Volumes/Macintosh/Users/thomasbruggemann/Sites/AIPRAT/analyze/data/com.drugguide.quiz/android/support/v4/util/AtomicFile.java",
        "line": "FileOutputStream var3 \u003d new FileOutputStream(this.mBaseName);",
        "extra": {}
      }
    ],
    "extra": {},
    "hierarchy": "CH44",
    "name": "OtherUserDeviceStorageContent"
  },
  {
    "probability": "MEDIUM",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CH45",
    "name": "ProviderStorageContent"
  },
  {
    "probability": "HIGH",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI211",
    "name": "BluetoothSensorContent"
  },
  {
    "probability": "HIGH",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI212",
    "name": "CameraContent"
  },
  {
    "probability": "HIGH",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI213",
    "name": "MicrophoneContent"
  },
  {
    "probability": "HIGH",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI214",
    "name": "NearFieldCommunicationContent"
  },
  {
    "probability": "HIGH",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI221",
    "name": "GpsSensorContent"
  },
  {
    "probability": "HIGH",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI222",
    "name": "NetworkConnectionSensorContent"
  },
  {
    "probability": "HIGH",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI223",
    "name": "WiFiSensorContent"
  },
  {
    "probability": "HIGH",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI231",
    "name": "FingerprintScannerContent"
  },
  {
    "probability": "HIGH",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI242",
    "name": "CookiesContent"
  },
  {
    "probability": "MEDIUM",
    "found": true,
    "snippets": [
      {
        "lineNumber": 93,
        "file": "/Volumes/Macintosh/Users/thomasbruggemann/Sites/AIPRAT/analyze/data/com.drugguide.quiz/com/drugguide/quiz/Descriptions.java",
        "line": "var6.putString(\"15\", \"Street Names: \\n\\n Diviner\\\u0027s Sage, Seers Sage, Ska Mar’a Pastora \\n\\n Salvia is a psychoactive plant which can induce dissociative effects and is a potent producer of visions and other hallucinatory experiences. Its native habitat is in cloud forest in the isolated Sierra Mazateca of Oaxaca, Mexico, where it grows in shady and moist locations. The plant grows to over a meter high, has hollow square stems, large leaves, and occasional white flowers with violet calyxes. Botanists have not determined whether Salvia divinorum is a cultigen or a hybrid; native plants reproduce vegetatively, rarely producing viable seed. \\n\\n Salvia divinorum remains legal in most countries and, within the United States, is legal in the majority of states. However, some have called for its prohibition. While not currently regulated by US federal drug laws, several states have passed laws criminalizing the substance. Some proposed state bills have failed to progress and have not been made into law (with motions having been voted down or otherwise dying in committee stages). There have not been many publicized prosecutions of individuals violating anti-salvia laws in the few countries and states in which it has been made illegal. \\n\\n Effects: \\n\\n After the peak effects, normal awareness-of-self and the immediate surroundings return but lingering effects may be felt. These short-term lingering effects have a completely different character than the peak experience. About half of users report a pleasing \\\u0027afterglow\\\u0027, or pleasant state of mind following the main effects. Researchers from the University of California and California Pacific Medical Center Research Institute conducted a survey of 500 salvia users which identified that they \\\u0027sometimes or often\\\u0027 experience certain effects, including: \\n\\n - Increased insight \\n\\n - Improved mood \\n\\n - Increased connection with Universe or Nature \\n\\n - Increased sweating \\n\\n - ody felt warm or hot \\n\\n Long Term Effects: \\n\\n Differing studies suggest no consensus so far with regard to the long-term effects of Salvia divinorum on mood. It is well-established that some k-opioid agonists can cause dysphoria in humans. One study using rats in forced-swim tests has been used to suggest that Salvia divinorum may have depressive-like effects, although this conclusion has been contradiucted by subsequent research. \\n\\n However, a report has been published detailing an individual case of Salvia divinorum use as self-medicated treatment for depression, and Baggott\\\u0027s survey of 500 people with firsthand experience of salvia found that 25.8% of respondents reported improved mood and antidepressant-like effects lasting 24 hours or longer. Only 4.4% reported persisting (24 hours or more) negative effects (most often anxiety) on at least one occasion. There has been one report of salvia precipitating psychosis. However, the authors suspected that their patient was already genetically predisposed to schizophrenia. \\n\\n It has been suggested that the long-term effects of salvia use may include feelings of Deja vu. The Baggott survey found little evidence of addictive potential (chemical dependence) in its survey population. 0.6% percent of respondents reported feeling addicted to or dependent on salvia at some point, and 1.2% reported strong cravings. About this the researchers said there were too few of these individuals to interpret their reports with any confidence Most users report no hangover or negative after-effects (e.g. withdrawal, comedown or rebound effect) the next day. This is consistent with the apparent low toxicity of salvia indicated by research conducted at the University of Nebraska. \\n\\n Overdose: \\n\\n Fatal poisoning from Salvia divinorum appears to be very unlikely to occur. No case of fatal salvinorin poisoning has been reported. The human oral lethal dose is not known but is believed to be extremely high. Swallowed salvinorin is not well absorbed. The chances of inadvertently swallowing a lethal overdose of an oral preparation of leaves, tinctures/elixirs, or soft/hard extracts are extremely low. \\n\\n If salvinorin is inhaled as multiple inhalations of leaf smoke or vapor one could reasonably expect to pass out before he/she could take a lethal overdose. But significantly, nothing is known about the toxic effects of smoking truly massive single bolus doses of pure salvinorin, such a practice might be quite dangerous, and should certainly be avoided. \\n\\n Acutely, salvinorin-A induces what could be termed a toxic psychosis, in other words one may see visions, hear voices, have bizarre thought patterns etc. This is normal when tripping. The acute effects of Salvia (both desirable and undesirable) wear off very quickly. However for some people the overwhelming strangeness of the Salvia experience (or perhaps some direct effect of salvinorin in the brain) can trigger panic attacks. \\n\\n Signs of Abuse: \\n\\n Salvia is not addicting and therefore there are few signs to tell if someone is abusing salvia repeatedly. The best way to find out would be to catch the person in the act of tripping, in which it would be very obvious the person was high on salvia. Salvia in most cases is non habit forming and does not pose addiction risk like some other drugs do. \\n\\n Physical Signs: \\n\\n - dilated pupils \\n\\n - fast heartbeat \\n\\n - intense hallucinations \\n\\n - paranoia \\n\\n - anxiety \\n\\n - dry mouth \\n\\n - laughter \\n\\n - feeling of being weighed down \\n\\n Treatment: \\n\\n There are currently no treatments for salvia as it is not considered habit forming. If someone were addicted to the substance they would seek traditional drug treatment programs. \\n\\n \");",
        "extra": {}
      },
      {
        "lineNumber": 102,
        "file": "/Volumes/Macintosh/Users/thomasbruggemann/Sites/AIPRAT/analyze/data/com.drugguide.quiz/com/drugguide/quiz/Descriptions.java",
        "line": "var6.putString(\"24\", \"Street Names: \\n\\n shrooms, mushrooms, magic mushrooms, caps, blue meanies (Panaeolus cyanescens), boomers, mushies, liberty caps (Psilocybe semilanceata), cubes (Psilocybe cubensis), liberties, magics, liberty cap, psilcybe semilanceata, psilcybin, shrooms, amani agaric, fly agaric \\n\\n An unusual item among our many different food sources, the mushroom is a fungus, not a plant. This means that it grows from a spore, usually in the dirt or on decaying plant material, such as a log. While some varieties contain vitamins and nutrients, mushrooms are mainly used to give an earthy flavor and meaty texture to everything from pizza to risotto. \\n\\n Some mushrooms, however, are famous for more than their taste. Known as magic mushrooms, shrooms, mushies, psychedelic mushrooms, psychotropic mushrooms or psilocybin, these mushrooms cause differences in mood, perception and behavior that are commonly known as tripping. \\n\\n These types of mushrooms belong to the genus Psilocybe. Mushrooms of other genera can also cause hallucinations, but many purists insist that Psilocybe mushrooms are the true magic mushrooms. Psilocybe mushrooms cause hallucinations because they contain the psychotropic tryptamines psilocybin and psilocin (some species also contain other, weaker psychotropic compounds like baeocystin or norbaeocystin). A single mushroom contains anywhere from 0.2 to 0.4 percent psilocybin. \\n\\n Magic mushrooms are one of the most widely used recreational psychotropic drugs because they can be found in the wild or grown fairly easily and inexpensively. According to the 2003 National Survey on Drug Use and Health, about 8 percent of adults over the age of 26 in the United States have used magic mushrooms [source: Substance Abuse \u0026 Mental Health Services Administration]. \\n\\n Unlike manufactured psychotropic drugs such as LSD, magic mushrooms have a long history dating back thousands of years as part of religious or spiritual ceremonies. However, magic mushrooms also have a lot in common with LSD. \\n\\n Effects: \\n\\n Mushrooms have a lot in common with LSD in terms of how they affect the body. Both are psychotropic drugs and act on the central nervous system to produce their effects. Many people have described a mushroom trip as a milder, shorter version of an LSD trip. Like LSD, magic mushrooms don\\\u0027t technically cause hallucinations, or visions of things that aren\\\u0027t actually there. Instead, they distort the perception of actual objects. \\n\\n People tripping on mushrooms might see things in different colors or see patterns. Existing colors, sounds, tastes and textures may be distorted, while feelings and emotions intensify. It can feel like time has sped up, slowed down or stopped completely. There can be a changed perception of one\\\u0027s place in the universe and a feeling of communing with a higher power. \\n\\n Overdose: \\n\\n Magic mushroom users report a wide range of symptoms, but one of the most common negative symptoms is colloquially referred to as a Òbad trip.Ó During a bad trip, mushroom users will feel extremely anxious or paranoid. They may become violent or withdrawn. These feelings wear off with the rest of the mushroomsÕ effects. \\n\\n Taking a large number of magic mushrooms will often result in extremely intense visual distortions that can be very unpleasant. This is often accompanies by waves of nausea. Some users may vomit after a mushrooms overdose. \\n\\n After a mushrooms overdose, a drug user may report symptoms similar to the hangover that follows excessive alcohol use. This mushroom ÒhangoverÓ can be extremely severe and can lead to intense nausea, headaches, and other nonfatal but unpleasant symptoms. \\n\\n Warning Signs of Abuse: \\n\\n Mushrooms aren\\\u0027t considered to be addictive, but tolerance builds up very quickly -- taking mushrooms two days in a row often results in a less intense experience the second day, for example. There may be cross-tolerance with some other psychotropic drugs like LSD, mescaline and peyote, which means that taking one can build up tolerance for another. \\n\\n So, are they dangerous? People with mental illnesses (diagnosed or not) have had their symptoms exacerbated through the use of mushrooms. There\\\u0027s no evidence of death caused by magic mushrooms; the amount that one would have to eat to cause death is hundreds of times greater than the normal dose. Death can result from taking misidentified mushrooms, however. \\n\\n\");",
        "extra": {}
      }
    ],
    "extra": {},
    "hierarchy": "CI243",
    "name": "SurveysContent"
  },
  {
    "probability": "MEDIUM",
    "found": false,
    "snippets": [],
    "extra": {
      "featureRatio": 0
    },
    "hierarchy": "CI311",
    "name": "AudioInformationContent"
  },
  {
    "probability": "HIGH",
    "found": true,
    "snippets": [
      {
        "lineNumber": -1,
        "file": "com.drugguide.quiz.ImageGallery.java",
        "line": "\u003ccom.drugguide.quiz.ImageGallery: void facebook(android.view.View)\u003e",
        "extra": {}
      },
      {
        "lineNumber": -1,
        "file": "com.drugguide.quiz.ImageGallery.java",
        "line": "\u003ccom.drugguide.quiz.ImageGallery: void twitter(android.view.View)\u003e",
        "extra": {}
      },
      {
        "lineNumber": -1,
        "file": "com.drugguide.quiz.ImageGallery.java",
        "line": "\u003ccom.drugguide.quiz.ImageGallery: void \u003cinit\u003e()\u003e",
        "extra": {}
      },
      {
        "lineNumber": -1,
        "file": "com.drugguide.quiz.ImageGallery.java",
        "line": "\u003ccom.drugguide.quiz.ImageGallery: void onCreate(android.os.Bundle)\u003e",
        "extra": {}
      },
      {
        "lineNumber": -1,
        "file": "com.drugguide.quiz.ImageGallery.java",
        "line": "\u003ccom.drugguide.quiz.ImageGallery: boolean onOptionsItemSelected(android.view.MenuItem)\u003e",
        "extra": {}
      },
      {
        "lineNumber": -1,
        "file": "com.drugguide.quiz.ImageGallery.java",
        "line": "\u003ccom.drugguide.quiz.ImageGallery: boolean onCreateOptionsMenu(android.view.Menu)\u003e",
        "extra": {}
      }
    ],
    "extra": {
      "featureRatio": 0
    },
    "hierarchy": "CI312",
    "name": "ImageInformationContent"
  },
  {
    "probability": "HIGH",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI314",
    "name": "TextInformationContent"
  },
  {
    "probability": "MEDIUM",
    "found": false,
    "snippets": [],
    "extra": {
      "featureRatio": 0
    },
    "hierarchy": "CI315",
    "name": "VideoInformationContent"
  },
  {
    "probability": "LOW",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI321",
    "name": "FinancialIdentifierContent"
  },
  {
    "probability": "LOW",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI322",
    "name": "GovernmentIdentifierContent"
  },
  {
    "probability": "LOW",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI323",
    "name": "NameContent"
  },
  {
    "probability": "LOW",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI324",
    "name": "OnlineContactContent"
  },
  {
    "probability": "LOW",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI325",
    "name": "PhysicalContactContent"
  },
  {
    "probability": "LOW",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI326",
    "name": "OwnUniqueIdentifierContent"
  },
  {
    "probability": "MEDIUM",
    "found": false,
    "snippets": [],
    "extra": {
      "featureRatio": 0
    },
    "hierarchy": "CI333",
    "name": "LocationContent"
  },
  {
    "probability": "MEDIUM",
    "found": false,
    "snippets": [],
    "extra": {
      "featureRatio": 0
    },
    "hierarchy": "CI335",
    "name": "OnlineContactsContent"
  },
  {
    "probability": "LOW",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI341",
    "name": "DemographicsContent"
  },
  {
    "probability": "LOW",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI343",
    "name": "HealthContent"
  },
  {
    "probability": "LOW",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI344",
    "name": "IdeologicalContent"
  },
  {
    "probability": "LOW",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI345",
    "name": "PreferencesContent"
  },
  {
    "probability": "LOW",
    "found": false,
    "snippets": [],
    "extra": {},
    "hierarchy": "CI346",
    "name": "UserDeviceContent"
  }
]
