define({
	"noSenseTitle": "मिला कोई मतलब नहीं आईडी",
	"noSenseMessage": "इस उपकरण अभी तक नब्ज पहचान पत्र नहीं सौंपा गया है। ई-मेल के माध्यम से एक घड़ी की उपयोगकर्ता पर आपको आमंत्रित करते हैं तो कृपया!",
	"noInternetTitle": "कोई इंटरनेट कनेक्शन नहीं",
	"noInternetMessage": "आप इस अनुप्रयोग का उपयोग करने के क्रम में इंटरनेट से जुड़े रहे हैं सुनिश्चित करें।",
	"noGPSTitle": "No जीपीएस",
	"gpsPermissionDenied": "जीपीएस अक्षम है या आवश्यक प्राधिकरण प्रदान किया गया है क्योंकि प्राप्त होता है कोई जीपीएस स्थिति, आई थी।"
});