define({
	"title": "काटना",
	"recording": {
		"start": "रिकॉर्डिंग शुरू",
		"stop": "रिकॉर्डिंग बंद करें"
	},
	"picture": "कैद तस्वीर",
	"network": "नेटवर्क",
	"gpsPermissionDenied": "जीपीएस अक्षम है या आवश्यक प्राधिकरण प्रदान किया गया है क्योंकि प्राप्त होता है कोई जीपीएस स्थिति, आई थी।",
	"inactive": "निष्क्रिय",
	"active": "सक्रिय",
	"errorTitle": "एक गलती हुई है",
	"inviteError": "आमंत्रण को स्वीकार बाहर सोया है। Support@frjsh.com से परामर्श करें",
	"defaultError": "वहाँ कुछ गलत हो गया था! फिर से कोशिश करें या support@frjsh.com दूर करने के लिए चालू करें",
	"photoTitle": "फोटो अपलोड करें",
	"photoMessage": "आपका फ़ोटो सफलतापूर्वक अपलोड कर दिया गया है।",
	"noGPSTitle": "No जीपीएस",
	"noGPSMessage": "एक उचित जीपीएस स्थिति के बिना फोटो शूट नहीं हो सकता!",
	"noPhotoMessage": "तस्वीर अपलोड नहीं किया जा सकता है।"
});