define({
	"noSenseTitle": "Найдено никакого смысла ID",
	"noSenseMessage": "Это устройство еще не назначен Sense ID. Пожалуйста, дайте пригласить вас на часы пользователем по электронной почте!",
	"noInternetTitle": "Нет подключения к Интернету",
	"noInternetMessage": "Пожалуйста, убедитесь, что вы подключены к Интернету, чтобы использовать это приложение.",
	"noGPSTitle": "Нет GPS",
	"gpsPermissionDenied": "Там не было никакой позиции GPS принимается, потому что GPS-отключен или необходимые разрешения были выданы."
});