define({
	"title": "Коса",
	"recording": {
		"start": "Начать запись",
		"stop": "Остановить запись"
	},
	"picture": "Захват изображения",
	"network": "Сеть",
	"gpsPermissionDenied": "Там не было никакой позиции GPS принимается, потому что GPS-отключен или необходимые разрешения были выданы.",
	"inactive": "Неактивный",
	"active": "Активный",
	"errorTitle": "Произошла ошибка",
	"inviteError": "Принимая приглашение из спал. Пожалуйста, обратитесь support@frjsh.com",
	"defaultError": "Там что-то пошло не так! Пожалуйста, попробуйте еще раз, или отвернуться, чтобы support@frjsh.com",
	"photoTitle": "Фото Загрузить",
	"photoMessage": "Ваша фотография была успешно загружена.",
	"noGPSTitle": "Нет GPS",
	"noGPSMessage": "Без надлежащей позиции GPS не может быть фотосессия!",
	"noPhotoMessage": "Фото не может быть загружен."
});