define({
	"startSense": "Начать СМЫСЛ",
	"buyWatch": "Freunde sehen, dein Boot sehen.<br>Hol dir WATCH",
	"intro": "Чтобы начать работу с этой Sense приложение, вы можете позволить вы либо пригласить пользователя WATCH, или просто с помощью парусные инструменты.",
	"welcome": "Добро пожаловать",
	"title": "СМЫСЛ",
	"invitation": "Принять приглашение",
	"pleaseInviteCode": "Пожалуйста, введите здесь свой код для приглашений, которые вы получили по электронной почте",
	"accept": "Принимать",
	"cancel": "Близко"
});